public_html/CP2/random_walk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2022-06-21 mar 12:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Random Walk</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Random Walk</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7a78fb4">Introduzione</a>
<ul>
<li><a href="#org33f5682">Lemma 7.12</a></li>
</ul>
</li>
<li><a href="#org2108004">Teorema 7.13 generalizzato</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7a78fb4" class="outline-2">
<h2 id="org7a78fb4">Introduzione</h2>
<div class="outline-text-2" id="text-org7a78fb4">
<p>
Consideriamo il modello di <b>passeggiata aleatoria</b> (<b>random walk</b>) su grafi <span class="underline">non orientati</span>.
Sia quindi un grafo \(G(V,E)\) con \(V\) <b>finito</b> e con archi non diretti.
Supponiamo inoltre che ogni nodo abbia <span class="underline">almeno un</span> arco incidente, ovvero \(\forall i \in V\) si ha che \(d(i) \geq 1\).<br />
</p>

<p>
Immaginare di avere una <i>particella</i> che si muove a caso sul grafo e, ad ogni passo, indipendentemente da quel che è successo prima,
si sceglie a caso uno dei \(d(i)\) archi che partono dal nodo \(i\) (quindi si tratta di una situazione con scelta equiprobabile degli archi tra cui scegliere).<br />
</p>

<p>
Il calcolo dei valori \(\lbrace d(i) : i \in  E \rbrace\) dipende da <i>"come si considerano i loop"</i> (cioè gli archi che vanno da un nodo in se stesso).
Si possono contare come archi doppi, o come archi singoli.
Facciamo un esempio.<br />
</p>

<p>
Supponiamo di avere un grafo con \(V = \lbrace 1,2 \rbrace\) ed \(E = \lbrace (1,2), (1,1) \rbrace\).
Possiamo contare il self-loop \((1,1)\) in due modi:
</p>
<ol class="org-ol">
<li>contare in maniera doppia, perché l'arco \((1,1)\) tocca il nodo 1 per due volte. Perciò \(d(1) = 3, d(2) = 1\) da cui \(d(1) + d(2) = 2 \vert E \vert\).</li>
<li>contare in maniera singola. Perciò \(d(1) = 2, d(2) = 1\) da cui \(d(1) + d(2) = 3 \neq 2 \vert E \vert\).</li>
</ol>

<p>
Più in generale, considerando il primo case, definiamo
\[
  D := \sum_{i \in V} d(i) = 2 \vert E \vert
  \]
</p>

<p>
Vediamo invece come è definita una passeggiata aleatoria in entrambi i casi.
Una passeggiata aleatoria è quindi una catena di Markov omogenea \(\lbrace X_t : t \geq 0 \rbrace\) tale che
\[
  p_{ij} = \frac{d(i,j)}{d(i)} \;\; \forall i,j \in V
  \]
dove con \(d(i,j)\) si indica il numero di archi tra \(i\) e \(j\).
In effetti ha senso considerare \(d(i,j)\) nel caso di self-loop.
Infatti nel caso 1 avremo che \(d(i,i) = 2)\), mentre nel caso 2 avremo \(d(i,i) = 1\).
Quindi, più in generale
</p>
<ol class="org-ol">
<li>caso arco doppio
\[
     d(i,j) = \begin{cases}
       0 &\mbox{se } (i,j) \notin E\\
       1 &\mbox{se } (i,j) \in E \land i \neq j\\
       2 &\mbox{se } (i,j) \in E \land i = j
     \end{cases}
     \]</li>
<li>caso arco singolo
\[
     d(i,j) = \begin{cases}
       0 &\mbox{se } (i,j) \notin E\\
       1 &\mbox{se } (i,j) \in E
     \end{cases}
     \]</li>
</ol>
<p>
Osservare inoltre che, essengo \(G\) non orientato, avremo che \(d(i,j) = d(j,i)\).<br />
</p>

<p>
Per capire meglio le differenze tra i due modelli, consideriamo ancora l'esempio precedente, e vediamo come varia \(P\).
</p>
<ol class="org-ol">
<li><p>
caso arco doppio, si ha che \(d(1,1) = 2, d(1,2) = d(2,1) = 1, d(2,2) = 0\), quindi
</p>
\begin{equation*}
P = \left (
\begin{array}{cc}
2/3 & 1/3 \\
1 & 0
\end{array}
\right )
\end{equation*}</li>
<li><p>
caso arco singolo, si ha che \(d(1,1) = 1, d(1,2) = d(2,1) = 1, d(2,2) = 0\), quindi
</p>
\begin{equation*}
P = \left (
\begin{array}{cc}
1/2 & 1/2 \\
1 & 0
\end{array}
\right )
\end{equation*}</li>
</ol>
</div>

<div id="outline-container-org33f5682" class="outline-3">
<h3 id="org33f5682">Lemma 7.12</h3>
<div class="outline-text-3" id="text-org33f5682">
<p>
Consideriamo una passeggiata aleatoria su un grafo, e supponiamo che sia un grafo <span class="underline">connesso</span> (e con almeno due elementi).
Allora si ha aperiodicità se e solo se il grafo <i>"non è bipartito"</i>.<br />
</p>

<p>
<b>Proof:</b> per ipotesi di connettività c'è anche <i>irriducibilità</i>.
Perciò tutti gli stati hanno lo stesso periodo \(\Delta\), con
\[
   \Delta = M.C.D. \lbrace t \geq 1 : p_{ii}^(t) > 0 \rbrace \;\; \forall i \in V
   \]
</p>

<p>
Allora, se il grafo è bipartito (tutti i cammini da uno stato in se stesso è costituito da un numero \(s\) <b>pari</b> di archi), si ha che \(p_{jj} = 0\) per \(s\) <span class="underline">dispari</span>.
Allora certamente ci sarà periodicità di periodo \(\Delta = 2\).<br />
</p>

<p>
Viceversa, se il grafo non è bipartito, si ha un \(M.C.D.\) di un insieme con numeri pari dispari.
Allora si ha \(\Delta = 1\) e quindi c’è aperiodicità \(\square\).
</p>
</div>
</div>
</div>

<div id="outline-container-org2108004" class="outline-2">
<h2 id="org2108004">Teorema 7.13 generalizzato</h2>
<div class="outline-text-2" id="text-org2108004">
<p>
Consideriamo una passeggiata aleatoria su un grafo.
Allora abbiamo le seguenti affermazioni.
</p>

<ol class="org-ol">
<li>La distribuzione \(\overline{\pi}\) dove
\[
     \pi_i = \frac{d(i)}{D} \;\; \forall i \in V
     \]
è una distribuzione stazionaria.</li>
<li>Supponiamo anche che il grafo sia <b>connesso</b>, con <b>almeno due nodi</b> e <b>non bipartito</b>.
Allora
\[
     \lim_{t \to \infty} p_{ji}^{(t)} = \frac{d(i)}{D} = \frac{1}{h_ii}
     \]</li>
</ol>

<p>
<b>Proof:</b>
</p>
<ol class="org-ol">
<li><p>
Per ogni nodo \(i \in V\) si ha che
</p>
\begin{align*}
  \sum_{j \in V} \pi_j p_{ji}
  &= \sum_{j \in V} \frac{d(j)}{D} \cdot \frac{d(j,i)}{d(j)}\\
  &= \frac{1}{D} \sum_{j \in V} d(j,i)\\
  &= \frac{1}{D} \sum_{j \in V} d(i,j)\\
  &= \frac{d(i)}{D}\\
  &= \pi_i
\end{align*}
<p>
perciò avremo che \(\overline{\pi} = \overline{\pi} P\).
</p></li>

<li>Per ipotesi di connettività avremo che \(P\) è irriducibile, inoltre dato che è non bipartito avremo che c'è anche aperiodicità (per teorema 7.12).
Inoltre per definizione \(V\) è finito, perciò possiamo applicare il teorema 7.7 (vedi <a href="./markov_chains.html">qua</a>) possiamo dire che
\[
     \lim_{t \to \infty} p_{ji}^{(t)} = \pi_i = \frac{d(i)}{D} = \frac{1}{h_ii} \;\;\; \square
     \]</li>
</ol>

<p>
<b>Osservazione</b> non è detto che nelle ipotesi del teorema \(\overline{\pi} = (\frac{d(i)}{D})_{i \in V}\) sia l'unica distribuzione stazionaria.
</p>
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2022-06-21 mar 12:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
